[
    {
      "bookId": 1,
      "bookName": "The Silent Patient",
      "author": "Alex Michaelides",
      "image": "https://i.ibb.co/sC6yFtR/The-Silent-Patient.jpg",
      "review": "A gripping psychological thriller that keeps you guessing until the very end. The story revolves around Alicia Berenson, a woman who shoots her husband and then stops speaking. The narrative is intense, with twists and turns that make it hard to put down. The psychological depth of the characters and the mystery at the heart of the plot make it a must-read for thriller fans.",
      "totalPages": 336,
      "rating": 4.7,
      "category": "Thriller",
      "tags": ["Suspense", "Psychological"],
      "publisher": "Celadon Books",
      "yearOfPublishing": 2019
    },
    {
      "bookId": 2,
      "bookName": "Educated",
      "author": "Tara Westover",
      "image": "https://i.ibb.co/GvBdpNz/deducated.jpg",
      "review": "Educated is a powerful memoir that chronicles Tara Westover's journey from growing up in a strict and abusive household in rural Idaho to earning a PhD from Cambridge University. The narrative is both heartbreaking and inspiring, as it explores the themes of education, self-discovery, and the struggle for independence. Westover's story is a testament to the transformative power of education.",
      "totalPages": 352,
      "rating": 4.6,
      "category": "Memoir",
      "tags": ["Inspiration", "Self-Discovery"],
      "publisher": "Random House",
      "yearOfPublishing": 2018
    },
    {
      "bookId": 3,
      "bookName": "Becoming",
      "author": "Michelle Obama",
      "image": "https://i.ibb.co/Gx6dm1L/Becoming.jpg",
      "review": "In Becoming, Michelle Obama shares her journey from the South Side of Chicago to the White House. The memoir is deeply personal and offers an intimate look at her life, from her childhood experiences to her time as First Lady of the United States. The book is both inspiring and thought-provoking, highlighting the importance of resilience, determination, and the pursuit of one’s own path.",
      "totalPages": 448,
      "rating": 4.8,
      "category": "Biography",
      "tags": ["Inspiration", "Leadership"],
      "publisher": "Crown Publishing Group",
      "yearOfPublishing": 2018
    },
    {
      "bookId": 4,
      "bookName": "Where the Crawdads Sing",
      "author": "Delia Owens",
      "image": "https://i.ibb.co/9gsNVxV/Where-the-Crawdads-Sing.webp",
      "review": "This novel beautifully blends a coming-of-age story with a suspenseful mystery. Set in the marshlands of North Carolina, the book follows the life of Kya Clark, a young girl who is abandoned by her family and grows up alone. The narrative is richly descriptive, bringing the natural setting to life, while the mystery surrounding a local murder adds an element of intrigue.",
      "totalPages": 384,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Mystery", "Nature"],
      "publisher": "G.P. Putnam's Sons",
      "yearOfPublishing": 2018
    },
    {
      "bookId": 5,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/SnXwdJF/1984.webp",
      "review": "1984 is a dystopian classic that explores the dangers of totalitarianism and extreme political ideology. Orwell’s depiction of a society under constant surveillance, where independent thinking is suppressed, remains relevant today. The novel’s themes of power, control, and individualism are thought-provoking, making it a timeless read for anyone interested in political fiction.",
      "totalPages": 328,
      "rating": 4.9,
      "category": "Dystopian",
      "tags": ["Political", "Classic"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 6,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/xYh4F4p/To-Kill-a-Mockingbird.jpg",
      "review": "A profound novel that tackles the issues of racial injustice and moral growth in the Deep South. Through the eyes of young Scout Finch, Harper Lee paints a powerful portrait of a community steeped in prejudice. The book’s exploration of empathy, integrity, and human rights makes it an essential read, with lessons that resonate across generations.",
      "totalPages": 281,
      "rating": 4.8,
      "category": "Classic",
      "tags": ["Social Issues", "Historical"],
      "publisher": "J.B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 7,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/891bqzR/The-Great-Gatsby.jpg",
      "review": "A timeless classic that delves into themes of ambition, love, and the American Dream. Set in the Roaring Twenties, the novel follows the mysterious Jay Gatsby and his obsession with the elusive Daisy Buchanan. Fitzgerald’s lyrical prose and sharp social commentary make The Great Gatsby a powerful exploration of wealth, class, and the human condition.",
      "totalPages": 180,
      "rating": 4.4,
      "category": "Classic",
      "tags": ["American Dream", "Tragedy"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 8,
      "bookName": "Sapiens: A Brief History of Humankind",
      "author": "Yuval Noah Harari",
      "image": "https://i.ibb.co/Qbv1KQD/brief-history-of-humankind.png",
      "review": "Sapiens is a compelling exploration of human history, from the emergence of Homo sapiens in Africa to the present day. Harari’s ability to distill complex ideas into accessible and engaging prose makes this book a fascinating read. It challenges readers to think critically about humanity’s past, present, and future, and the forces that have shaped our societies.",
      "totalPages": 464,
      "rating": 4.5,
      "category": "History",
      "tags": ["Anthropology", "Philosophy"],
      "publisher": "Harper",
      "yearOfPublishing": 2011
    },
    {
      "bookId": 9,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/DtMSvhN/The-Catcher-in-the-Rye.png",
      "review": "This iconic novel captures the struggles of teenage angst and alienation through the eyes of Holden Caulfield. Salinger’s portrayal of a young man disillusioned with the phoniness of the adult world resonates with readers of all ages. The novel’s themes of identity, loss, and rebellion make it a poignant and enduring work of American literature.",
      "totalPages": 214,
      "rating": 4.3,
      "category": "Classic",
      "tags": ["Coming of Age", "Psychological"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    }
  ]
  